## Modules

In [ ]:
#Ex:1

import math

In [ ]:
x = 81
math.sqrt(x)

In [ ]:
2**3

In [ ]:
math.pow(3,3)

In [ ]:
dir(math)

In [ ]:
#Ex:2

import calendar

In [ ]:
cal = calendar.month(2023,7)

In [ ]:
print(cal)

In [ ]:
calendar.isleap(2024)

In [ ]:
calendar.isleap(2023)

In [ ]:
dir(calendar)

In [ ]:
#Ex.3
import datetime

In [ ]:
x = datetime.datetime.now()
print(x)

In [ ]:
y=datetime.date.today()
print(y)

In [ ]:
dir(datetime)

In [ ]:
a=datetime.date(1985,1,20)
print(a)

In [ ]:
a.year

In [ ]:
a.month

In [ ]:
a.day

In [ ]:
x_date=datetime.date(2020,1,20)

In [ ]:
x_time=datetime.time(20,25,0)

In [ ]:
x_datetime=datetime.datetime(2021,1,20,20,25,0,0)

In [ ]:
print(x_date)

In [ ]:
print(x_time)

In [ ]:
print(x_datetime)

## Dataframe

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [2]:
import webbrowser

In [ ]:
website = 'https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html'

In [ ]:
webbrowser.open(website)

In [ ]:
df= pd.read_clipboard()

In [ ]:
df

## Creating dataframes using numpy and dictionaries

In [ ]:
x=np.array([[1,2,3],[4,5,6]])
x

In [ ]:
dict1=DataFrame({'col1':[1,2,3],"col2":[4,5,6]})
dict1

In [3]:
## Read a csv file
df1 = pd.read_csv('C:/Users/Shubh/OneDrive/Desktop/Universities.csv')

In [ ]:
df1

In [ ]:
type(df1)

In [ ]:
#df1 = pd.read_csv('Universities.csv',nrows = 2)
#df1

In [ ]:
#df1 = pd.read_csv('Universities.csv',usecols=[1,3])
#df1

In [4]:
df1.columns

Index(['Univ', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses', 'GradRate'], dtype='object')

In [ ]:
df1['SAT']

In [ ]:
df1[['SAT','Accept']]

In [5]:
df1.head()

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0     Brown  1310     89      22       13     22704        94
1   CalTech  1415    100      25        6     63575        81
2       CMU  1260     62      59        9     25026        72
3  Columbia  1310     76      24       12     31510        88
4   Cornell  1280     83      33       13     21864        90

In [12]:
df1.head(10)

           Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0         Brown  1310     89      22       13     22704        94
1       CalTech  1415    100      25        6     63575        81
2           CMU  1260     62      59        9     25026        72
3      Columbia  1310     76      24       12     31510        88
4       Cornell  1280     83      33       13     21864        90
5     Dartmouth  1340     89      23       10     32162        95
6          Duke  1315     90      30       12     31585        95
7    Georgetown  1255     74      24       12     20126        92
8       Harvard  1400     91      14       11     39525        97
9  JohnsHopkins  1305     75      44        7     58691        87

In [ ]:
df1.tail()

In [10]:
df1.tail(2)

          Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
23  UWisconsin  1085     40      69       15     11857        71
24        Yale  1375     95      19       11     43514        96

In [30]:
df1.iloc[4]

Univ        Cornell
SAT            1280
Top10            83
Accept           33
SFRatio          13
Expenses      21864
GradRate         90
Name: 4, dtype: object

In [9]:
df1.iloc[0:11]

            Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0          Brown  1310     89      22       13     22704        94
1        CalTech  1415    100      25        6     63575        81
2            CMU  1260     62      59        9     25026        72
3       Columbia  1310     76      24       12     31510        88
4        Cornell  1280     83      33       13     21864        90
5      Dartmouth  1340     89      23       10     32162        95
6           Duke  1315     90      30       12     31585        95
7     Georgetown  1255     74      24       12     20126        92
8        Harvard  1400     91      14       11     39525        97
9   JohnsHopkins  1305     75      44        7     58691        87
10           MIT  1380     94      30       10     34870        91

In [13]:
df2 = pd.read_csv('C:/Users/Shubh/OneDrive/Desktop/Universities.csv')
df2.head()

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0     Brown  1310     89      22       13     22704        94
1   CalTech  1415    100      25        6     63575        81
2       CMU  1260     62      59        9     25026        72
3  Columbia  1310     76      24       12     31510        88
4   Cornell  1280     83      33       13     21864        90

In [15]:
df2 = pd.read_csv('C:/Users/Shubh/OneDrive/Desktop/Universities.csv',index_col = 'Univ')
df2

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310     89      22       13     22704        94
CalTech       1415    100      25        6     63575        81
CMU           1260     62      59        9     25026        72
Columbia      1310     76      24       12     31510        88
Cornell       1280     83      33       13     21864        90
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Georgetown    1255     74      24       12     20126        92
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87
MIT           1380     94      30       10     34870        91
Northwestern  1260     85      39       11     28052        89
NotreDame     1255     81      42       13     15122        94
PennState     1081     38      54       18     10185        80
Princeton     1375     91      14        8     30220        95
Purdue        1005     28      90       19      9066        69
Stanford      1360     90      20       12     36450        93
TexasA&M      1075     49      67       25      8704        67
UCBerkeley    1240     95      40       17     15140        78
UChicago      1290     75      50       13     38380        87
UMichigan     1180     65      68       16     15470        85
UPenn         1285     80      36       11     27553        90
UVA           1225     77      44       14     13349        92
UWisconsin    1085     40      69       15     11857        71
Yale          1375     95      19       11     43514        96

In [21]:
df2.loc['Yale']

SAT          1375
Top10          95
Accept         19
SFRatio        11
Expenses    43514
GradRate       96
Name: Yale, dtype: int64

In [17]:
df2.iloc[2]

SAT          1260
Top10          62
Accept         59
SFRatio         9
Expenses    25026
GradRate       72
Name: CMU, dtype: int64

In [18]:
df2.loc[['UVA','Yale']]

       SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
UVA   1225     77      44       14     13349        92
Yale  1375     95      19       11     43514        96

In [19]:
df2.loc['UVA':'Yale']

             SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
UVA         1225     77      44       14     13349        92
UWisconsin  1085     40      69       15     11857        71
Yale        1375     95      19       11     43514        96

In [22]:
df1.shape

(25, 7)

In [23]:
df2.shape

(25, 6)

In [24]:
x= df2.drop('CMU',axis =0)
x

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310     89      22       13     22704        94
CalTech       1415    100      25        6     63575        81
Columbia      1310     76      24       12     31510        88
Cornell       1280     83      33       13     21864        90
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Georgetown    1255     74      24       12     20126        92
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87
MIT           1380     94      30       10     34870        91
Northwestern  1260     85      39       11     28052        89
NotreDame     1255     81      42       13     15122        94
PennState     1081     38      54       18     10185        80
Princeton     1375     91      14        8     30220        95
Purdue        1005     28      90       19      9066        69
Stanford      1360     90      20       12     36450        93
TexasA&M      1075     49      67       25      8704        67
UCBerkeley    1240     95      40       17     15140        78
UChicago      1290     75      50       13     38380        87
UMichigan     1180     65      68       16     15470        85
UPenn         1285     80      36       11     27553        90
UVA           1225     77      44       14     13349        92
UWisconsin    1085     40      69       15     11857        71
Yale          1375     95      19       11     43514        96

In [25]:
x.shape

(24, 6)

In [26]:
y = df2.drop('Top10',axis =1)
y

               SAT  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310      22       13     22704        94
CalTech       1415      25        6     63575        81
CMU           1260      59        9     25026        72
Columbia      1310      24       12     31510        88
Cornell       1280      33       13     21864        90
Dartmouth     1340      23       10     32162        95
Duke          1315      30       12     31585        95
Georgetown    1255      24       12     20126        92
Harvard       1400      14       11     39525        97
JohnsHopkins  1305      44        7     58691        87
MIT           1380      30       10     34870        91
Northwestern  1260      39       11     28052        89
NotreDame     1255      42       13     15122        94
PennState     1081      54       18     10185        80
Princeton     1375      14        8     30220        95
Purdue        1005      90       19      9066        69
Stanford      1360      20       12     36450        93
TexasA&M      1075      67       25      8704        67
UCBerkeley    1240      40       17     15140        78
UChicago      1290      50       13     38380        87
UMichigan     1180      68       16     15470        85
UPenn         1285      36       11     27553        90
UVA           1225      44       14     13349        92
UWisconsin    1085      69       15     11857        71
Yale          1375      19       11     43514        96

In [27]:
y.shape

(25, 5)

In [28]:
df2.head()

           SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown     1310     89      22       13     22704        94
CalTech   1415    100      25        6     63575        81
CMU       1260     62      59        9     25026        72
Columbia  1310     76      24       12     31510        88
Cornell   1280     83      33       13     21864        90

In [29]:
df2.describe()

               SAT       Top10     Accept   SFRatio      Expenses   GradRate
count    25.000000   25.000000  25.000000  25.00000     25.000000  25.000000
mean   1266.440000   76.480000  39.200000  12.72000  27388.000000  86.720000
std     108.359771   19.433905  19.727308   4.06735  14424.883165   9.057778
min    1005.000000   28.000000  14.000000   6.00000   8704.000000  67.000000
25%    1240.000000   74.000000  24.000000  11.00000  15140.000000  81.000000
50%    1285.000000   81.000000  36.000000  12.00000  27553.000000  90.000000
75%    1340.000000   90.000000  50.000000  14.00000  34870.000000  94.000000
max    1415.000000  100.000000  90.000000  25.00000  63575.000000  97.000000

## Handling with null values

In [31]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [32]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [33]:
new_frame= dframe.dropna() # Drop the rows having na 
new_frame

     0    1    2
0  1.0  2.0  3.0

In [34]:
new_frame=dframe.dropna(how='all')  # Drop the rows having na's in all the rows
new_frame

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [38]:
new_frame=dframe.dropna(axis = 1)  # Drop the Columns having na's in all the columns
new_frame

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [36]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [40]:
dframe.dropna(thresh = 2) # Drop the rows not having atleast 2 values

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [43]:
dframe.fillna(15)

      0     1     2
0   1.0   2.0   3.0
1  15.0   5.0   6.0
2   7.0  15.0   9.0
3  15.0  15.0  15.0